package cli

import (
	"fmt"
	"os"

	"golang.org/x/term"
)

func Run() {
	// [1] go-serve
	// [2] run/init
	// [3] file/-
	printSplash()
	if len(os.Args) < 2 {
		fmt.Fprint(os.Stderr, "please provide a command")
		printUsage()
		os.Exit(1)
	}

	switch os.Args[1] {
	case "run":
		runCMD(os.Args[2:])
	case "help":
		printUsage()
	default:
		fmt.Fprintf(os.Stderr, "unknown command: %s\n", os.Args[1])
		printUsage()
	}
}

func printUsage() {
	fmt.Println("Usage: go-serve <commands> [options]")
	fmt.Println()
	fmt.Println("Commands:")
	fmt.Println("	run    Run the entry-point go file")
	fmt.Println("	init   Initialize the config file")
	fmt.Println("	help   Print this help screen")
	fmt.Println("Flags:")
}

func printSplash() {
	fd := int(os.Stdout.Fd())
	w, _, err := term.GetSize(fd)
	if err != nil || w < 87 {
		fmt.Fprintln(os.Stdout, 
`▗▄▄▖ ▗▄▖  ▗▄▄▖▗▄▄▄▖▗▄▄▖ ▗▖  ▗▖▗▄▄▄▖
▐▌   ▐▌ ▐▌▐▌   ▐▌   ▐▌ ▐▌▐▌  ▐▌▐▌   
▐▌▝▜▌▐▌ ▐▌ ▝▀▚▖▐▛▀▀▘▐▛▀▚▖▐▌  ▐▌▐▛▀▀▘
▝▚▄▞▘▝▚▄▞▘▗▄▄▞▘▐▙▄▄▖▐▌ ▐▌ ▝▚▞▘ ▐▙▄▄▖
 `)
	} else {
		fmt.Fprintln(os.Stdout, `
   ▄██████▄   ▄██████▄     ▄████████    ▄████████    ▄████████  ▄█    █▄     ▄████████ 
  ███    ███ ███    ███   ███    ███   ███    ███   ███    ███ ███    ███   ███    ███ 
  ███    █▀  ███    ███   ███    █▀    ███    █▀    ███    ███ ███    ███   ███    █▀  
 ▄███        ███    ███   ███         ▄███▄▄▄      ▄███▄▄▄▄██▀ ███    ███  ▄███▄▄▄     
▀▀███ ████▄  ███    ███ ▀███████████ ▀▀███▀▀▀     ▀▀███▀▀▀▀▀   ███    ███ ▀▀███▀▀▀     
  ███    ███ ███    ███          ███   ███    █▄  ▀███████████ ███    ███   ███    █▄  
  ███    ███ ███    ███    ▄█    ███   ███    ███   ███    ███ ███    ███   ███    ███ 
  ████████▀   ▀██████▀   ▄████████▀    ██████████   ███    ███  ▀██████▀    ██████████
  `)
	}

}
